Tekla.Structures.Analysis.UI.AnalysisObjectPicker
The AnalysisObjectPicker class can be used to prompt the user to do manual picks of analysis objects.
The methods throw an exception if the user interrupts (cancels) the pick command.

Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObject(System.String,Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType,System.String)
Prompts the user to pick object from the model with the given prompt.
Object is either analysis object or model object.
analysisModelName: The analysis model name.
type: The type of object to pick.
prompt: The string to display as user guidance.
Returns: The analysis object instance.

Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjects(System.String,Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType,System.String)
Prompts the user to pick objects from the model with the given prompt.
analysisModelName: The analysis model name.
type: The type of objects to pick.
prompt: The string to display as user guidance.
Returns: An enumerator of analysis object instances.